Repository: quarkusio/es.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: es_es

source: Change it back and the tests will run again.
es_es: Vuelva a cambiarlo y las pruebas se ejecutarán de nuevo.

source: Change the last two commands in the `Dockerfile.native` file and make it read like this:
es_es: Cambia los dos últimos comandos en el archivo `Dockerfile.native` y haz que se lea así:

source: Changing configuration values
es_es: Modificación de los valores de configuración

source: Chat using <a href="https://quarkusio.zulipchat.com" target="_blank">Zulip</a> (<code>#dev</code> stream)
es_es: Chat con <a href="https://quarkusio.zulipchat.com" target="_blank">Zulip</a> (<code>#dev</code> stream)

source: Chat using <a href="https://quarkusio.zulipchat.com/#narrow/stream/187038-dev" target="_blank">Zulip</a> (<code>#dev</code> stream)
es_es: Chat con <a href="https://quarkusio.zulipchat.com/#narrow/stream/187038-dev" target="_blank">Zulip</a> (<code>#dev</code> stream)

source: Check out our <a href="https://github.com/quarkusio/quarkus" target="_blank">GitHub</a> for details on reporting issues and the process for submitting pull requests.
es_es: Consulta nuestro <a href="https://github.com/quarkusio/quarkus" target="_blank">GitHub</a> para conocer los detalles sobre la notificación de problemas y el proceso de envío de pull requests.

source: Check out our <a href="https://github.com/quarkusio/quarkus/discussions">GitHub Discussions</a> collaboration area to interact with other Quarkus users and developers.
es_es: Consulta nuestra zona de colaboración <a href="https://github.com/quarkusio/quarkus/discussions">GitHub Discussions</a> para interactuar con otros usuarios y desarrolladores de Quarkus.

source: Check out these applicable guides:
es_es: Consulte estas guías aplicables:

source: Check the HTTP response status code and content
es_es: Compruebe el código de estado de la respuesta HTTP y el contenido

source: Choosing your build tool
es_es: Elección de la herramienta de construcción

source: Clearing of caches
es_es: Borrado de cachés

source: Client configuration
es_es: Configuración del cliente

source: Client configuration example
es_es: Ejemplo de configuración de cliente

source: Clone the Git repository: `git clone {quickstarts-clone-url}`, or download an {quickstarts-archive-url}[archive].
es_es: Clone el repositorio Git: `git clone {quickstarts-clone-url}` o descargue un {quickstarts-archive-url}[archivo].

source: Closed-Source
es_es: Fuente cerrada

source: Code and Issue Tracker
es_es: Rastreador de código fuente y problemas

source: Combine both the familiar imperative code and the reactive style when developing applications.
es_es: Combine tanto el código imperativo conocido como el estilo reactivo al desarrollar aplicaciones.

source: Come Join Us
es_es: Únete a nosotros

source: Command Line Interface
es_es: Interfaz de línea de comandos

source: Common project setup
es_es: Configuración del proyecto común

source: Communities are a critical aspect to any open source project’s success, including Quarkus. It is no surprise that the health of a community is a major consideration when an adoption decision must be made. For Adoptium, this is made clear by example:
es_es: Las comunidades son un aspecto crítico para el éxito de cualquier proyecto de código abierto, incluido Quarkus. No es de extrañar que la salud de una comunidad sea una consideración importante cuando hay que tomar una decisión de adopción. En el caso de Adoptium, esto queda claro con el ejemplo:

source: Community and Standards
es_es: Comunidad y normas

source: Compatibility
es_es: Compatibilidad

source: Compatible with Quarkus
es_es: Compatible con Quarkus

source: Components
es_es: Componentes

source: Compressing native executables using UPX
es_es: Compresión de ejecutables nativos con UPX

source: Compression level
es_es: Nivel de compresión

source: Conditional Dependencies
es_es: Dependencias condicionales

source: Conditional Extension Dependencies
es_es: Dependencias de extensión condicional

source: Conditional capability promises and requirements
es_es: Promesas y requisitos de capacidad condicionales

source: Conditional dependencies can also be configured in the Quarkus extension descriptor. The conditional dependency configured above could be expressed in the extension descriptor of `quarkus-extension-a` as:
es_es: Las dependencias condicionales también pueden configurarse en el descriptor de la extensión de Quarkus. La dependencia condicional configurada anteriormente podría expresarse en el descriptor de extensión de `quarkus-extension-a` como:

source: Config autocompletion
es_es: Configurar el autocompletado

source: Config editor
es_es: Editor de configuración

source: Config jump to definition
es_es: Salto de configuración a la definición

source: Config outline
es_es: Esquema de configuración

source: Config profiles
es_es: Perfiles de configuración

source: Config validation
es_es: Validación de la configuración

source: ConfigMaps and Secrets created from files named `application.properties`, `application.yaml` or `application.yml` (see https://kubernetes.io/docs/tasks/configure-pod-container/configure-pod-configmap/#create-configmaps-from-files[this] for an example on how to create one).
es_es: ConfigMaps y Secretos creados a partir de archivos denominados `application.properties`, `application.yaml` o `application.yml` (ver https://kubernetes.io/docs/tasks/configure-pod-container/configure-pod-configmap/#create-configmaps-from-files[aquí] un ejemplo de cómo crear uno).

source: ConfigMaps and Secrets that contain literal data (see https://kubernetes.io/docs/tasks/configure-pod-container/configure-pod-configmap/#create-configmaps-from-literal-values[this] for an example on how to create one)
es_es: ConfigMaps y Secretos que contienen datos literales (vea https://kubernetes.io/docs/tasks/configure-pod-container/configure-pod-configmap/#create-configmaps-from-literal-values[esto] para un ejemplo sobre cómo crear uno)

source: Configuration
es_es: Configuración

source: Configuration Reference
es_es: Referencia de configuración

source: Configuration key conflicts
es_es: Conflictos de claves de configuración

source: Configuration reference
es_es: Referencia de configuración

source: Configure the default `datacontenttype` attribute of the outgoing Cloud Event. Requires `cloud-events` to be set to `true`. This value is used if the message does not configure the `datacontenttype` attribute itself Type: _string_
es_es: Configura el atributo `datacontenttype` por defecto del Evento de Nube saliente. Requiere que `cloud-events` esté configurado como `true`. Este valor se utiliza si el mensaje no configura el atributo `datacontenttype` por sí mismo Type: _string_

source: Configure the default `dataschema` attribute of the outgoing Cloud Event. Requires `cloud-events` to be set to `true`. This value is used if the message does not configure the `dataschema` attribute itself Type: _string_
es_es: Configura el atributo `dataschema` por defecto del Evento de Nube saliente. Requiere que `cloud-events` esté configurado como `true`. Este valor se utiliza si el mensaje no configura el atributo `dataschema` por sí mismo Type: _string_

source: Configure the default `source` attribute of the outgoing Cloud Event. Requires `cloud-events` to be set to `true`. This value is used if the message does not configure the `source` attribute itself Type: _string_
es_es: Configura el atributo `source` por defecto del Evento de Nube saliente. Requiere que `cloud-events` esté configurado como `true`. Este valor se utiliza si el mensaje no configura el atributo `source` por sí mismo Type: _string_

source: Configure the default `subject` attribute of the outgoing Cloud Event. Requires `cloud-events` to be set to `true`. This value is used if the message does not configure the `subject` attribute itself Type: _string_
es_es: Configura el atributo `subject` por defecto del Evento de Nube saliente. Requiere que `cloud-events` esté configurado como `true`. Este valor se utiliza si el mensaje no configura el atributo `subject` por sí mismo Type: _string_

source: Configure the default `type` attribute of the outgoing Cloud Event. Requires `cloud-events` to be set to `true`. This value is used if the message does not configure the `type` attribute itself Type: _string_
es_es: Configura el atributo `type` por defecto del Evento de Nube saliente. Requiere que `cloud-events` esté configurado como `true`. Este valor se utiliza si el mensaje no configura el atributo `type` por sí mismo Type: _string_

source: Configure the name of the secret that will be used. This doesn't need to be prefixed with the `%prod` profile as it won't have any effect if secret reading is disabled.
es_es: Configure el nombre del secreto que se utilizará. No es necesario anteponer el perfil `%prod`, ya que no tendrá ningún efecto si la lectura del secreto está desactivada.

source: Configures the broker/router host name. You can do it per channel (using the `host` attribute) or globally using `amqp-host`
es_es: Configura el nombre de host del broker/router. Puedes hacerlo por canal (usando el atributo `host` ) o globalmente usando `amqp-host`

source: Configures the broker/router password if required. You can do it per channel (using the `password` attribute) or globally using `amqp-password`.
es_es: Configura la contraseña del broker/router si es necesario. Puedes hacerlo por canal (usando el atributo `password` ) o globalmente usando `amqp-password`.

source: Configures the broker/router port. You can do it per channel (using the `port` attribute) or globally using `amqp-port`. The default is `5672`.
es_es: Configura el puerto del broker/router. Puedes hacerlo por canal (usando el atributo `port` ) o globalmente usando `amqp-port`. El valor por defecto es `5672`.

source: Configures the broker/router username if required. You can do it per channel (using the `username` attribute) or globally using `amqp-username`.
es_es: Configura el nombre de usuario del broker/router si es necesario. Puedes hacerlo por canal (usando el atributo `username` ) o globalmente usando `amqp-username`.

source: Configuring Continuous Testing
es_es: Configuración de las pruebas continuas

source: Configuring Kafka topics
es_es: Configuración de los temas de Kafka

source: Configuring Root Paths
es_es: Configuración de las rutas de acceso a la raíz

source: Configuring User Information
es_es: Configuración de la información del usuario

source: Configuring the AMQP Broker access
es_es: Configuración del acceso al Broker AMQP

source: Configuring the AMQP address
es_es: Configuración de la dirección AMQP

source: Configuring the UPX compression
es_es: Configuración de la compresión UPX

source: Configuring the application
es_es: Configuración de la aplicación

source: Configuring the banner
es_es: Configuración del banner

source: Configuring the cluster
es_es: Configuración del clúster

source: Configuring the image
es_es: Configuración de la imagen

source: Configuring your project
es_es: Configurar el proyecto

source: Configuring your project to use the Quarkus Kubernetes extension
es_es: Configuración de su proyecto para utilizar la extensión Quarkus Kubernetes

source: Connector auto-attachment
es_es: Conexión automática de los conectores

source: Container First
es_es: Contenedor primero

source: Container Image Options
es_es: Opciones de imagen del contenedor

source: Container Image extensions
es_es: Extensiones de la imagen del contenedor

source: Container Images
es_es: Imágenes de contenedores

source: Context injection
es_es: Inyección de contexto

source: Continuous Testing
es_es: Pruebas continuas

source: Continuous Testing Without Dev Mode
es_es: Pruebas continuas sin modo de desarrollo

source: Contributing
es_es: Contribuyendo a

source: Contributing to the Quarkus.io website
es_es: Contribuyendo al sitio web de Quarkus.io

source: Contributions are welcome, please submit pull requests for the `develop` branch.
es_es: Las contribuciones son bienvenidas, pro favor envíe la solicitud de pull requests a la rama `develop` branch.

source: Contributors
es_es: Colaboradores

source: Controlling Continuous Testing
es_es: Control de las pruebas continuas

source: Cool stuff right? <a href="https://quarkus.io/guides/maven-tooling#dev-mode">Learn more about Quarkus's dev mode</a>.
es_es: Es una cosa genial, ¿verdad? <a href="https://quarkus.io/guides/maven-tooling#dev-mode">Aprende más sobre el modo de desarrollo de Quarkus</a>.

source: Create a microservice using your favorite Spring API.
es_es: Cree un microservicio utilizando su API de Spring favorita.

source: Create a portable Java API to write serverless functions deployable to AWS Lambda, Azure Functions, Knative, and more.
es_es: Cree una API Java portátil para escribir funciones sin servidor desplegables en AWS Lambda, Azure Functions, Knative, etc.

source: Create an Azure Container Registry instance
es_es: Crear una instancia de Azure Container Registry

source: Create an Azure Registry Service instance and upload the Docker image
es_es: Crear una instancia de Azure Registry Service y subir la imagen Docker

source: Create and debug applications in the same environment where applications run. Live coding in development mode where any changes made locally will be immediately visible in a clustered Kubernetes environment. <a href="https://developers.redhat.com/blog/2021/02/11/enhancing-the-development-loop-with-quarkus-remote-development">Read this blog post for greater insight.</a>
es_es: Cree y depure aplicaciones en el mismo entorno donde se ejecutan las aplicaciones. Codificación en vivo en el modo de desarrollo, donde cualquier cambio realizado localmente será inmediatamente visible en un entorno de Kubernetes en clúster. <a href="https://developers.redhat.com/blog/2021/02/11/enhancing-the-development-loop-with-quarkus-remote-development">Lea esta entrada del blog para obtener más información.</a>

source: Create inside the `producer` project `src/main/resources/META-INF/resources/quotes.html` file, with the following content:
es_es: Cree dentro del proyecto `producer` el archivo `src/main/resources/META-INF/resources/quotes.html`, con el siguiente contenido:

source: Create projects, manage extensions, and execute essential build and dev commands.
es_es: Cree proyectos, gestione extensiones y ejecute comandos esenciales de construcción y desarrollo.

source: Create the Getting Started Application
es_es: Crear la aplicación de inicio

source: Created on
es_es: Creado el

source: Creating Your First Application
es_es: Creando su primera aplicación

source: Creating the Maven Deployment Project
es_es: Creación del proyecto de Maven

source: Creating the Maven Project
es_es: Creación del proyecto Maven

source: Creating the Maven project
es_es: Creación del proyecto Maven

source: Creating the endpoints
es_es: Creación de los endpoints

source: Credential profiles file at the default location (`~/.aws/credentials`) shared by all AWS SDKs and the AWS CLI
es_es: Archivo de perfiles de credenciales en la ubicación por defecto ( `~/.aws/credentials`) compartido por todos los SDKs de AWS y la CLI de AWS

source: Current limitations
es_es: Limitaciones actuales

source: Currently, only the default backend for Hibernate Search Elasticsearch is supported, because Dev Services for Elasticsearch can only start one Elasticsearch container.
es_es: Actualmente, sólo se admite el backend predeterminado para Hibernate Search Elasticsearch, porque Dev Services for Elasticsearch sólo puede iniciar un contenedor de Elasticsearch.

source: Custom Wizard
es_es: Asistente personalizado

source: Customizing
es_es: Personalizar

source: Customizing the underlying AMQP client
es_es: Personalización del cliente AMQP subyacente

source: DOCUMENTATION
es_es: DOCUMENTACIÓN

source: Database import scripts
es_es: Scripts de importación de bases de datos

source: Databases
es_es: Bases de datos

source: December 6, 2019
es_es: 6 de diciembre de 2019

source: Declaring a conditional dependency in the Quarkus extension descriptor
es_es: Declarar una dependencia condicional en el descriptor de extensión de Quarkus

source: Declaring a dependency as `optional`
es_es: Declarar una dependencia como `optional`

source: Declaring capabilities
es_es: Declarar las capacidades

source: Default
es_es: Por defecto

source: Defining Bindings
es_es: Definición de enlaces

source: Defining Exchanges
es_es: Definición de los intercambios

source: Defining Queues
es_es: Definición de colas

source: Defining your entity
es_es: Definir su entidad

source: Defining your repository
es_es: Definir el repositorio

source: Deploy as container
es_es: Desplegar como contenedor

source: Deploy the Docker image to Azure App Service for Linux Containers
es_es: Despliegue de la imagen Docker en Azure App Service para contenedores Linux

source: Deploy the Docker image to Azure Container Instances
es_es: Despliegue de la imagen Docker en Azure Container Instances

source: Deploy the Docker image to Azure Kubernetes Service
es_es: Desplegar la imagen Docker en el servicio Azure Kubernetes

source: Deploy the application as Docker image to Heroku
es_es: Desplegar la aplicación como imagen Docker en Heroku

source: Deploy the application to Heroku
es_es: Despliegue de la aplicación en Heroku

source: Deploy the native application as Docker image to Heroku
es_es: Desplegar la aplicación nativa como imagen Docker en Heroku

source: Deploy the repository and build on Heroku
es_es: Desplegar el repositorio y construir en Heroku

source: Deploy the service:
es_es: Despliegue el servicio:

source: Deploy to Azure App Service on Linux Containers
es_es: Despliegue en Azure App Service en contenedores Linux

source: Deploy to Azure Container Instances
es_es: Despliegue en instancias de contenedores Azure

source: Deploy to Azure Kubernetes Service
es_es: Despliegue en el servicio Azure Kubernetes

source: Deploy to Kubernetes/OpenShift
es_es: Despliegue en Kubernetes/OpenShift

source: Deploying Quarkus Applications on Kubernetes
es_es: Despliegue de aplicaciones Quarkus en Kubernetes

source: Deploying to Heroku
es_es: Despliegue en Heroku

source: Deploying to Microsoft Azure Cloud
es_es: Despliegue en la nube de Microsoft Azure

source: Deploying your gRPC Service in Kubernetes
es_es: Despliegue de su servicio gRPC en Kubernetes

source: Description
es_es: Descripción

source: Deserialization
es_es: Deserialización

source: Dev Services
es_es: Servicios de desarrollo

source: Dev Services Overview
es_es: Visión general de los servicios de desarrollo

source: Dev Services for AMQP
es_es: Servicios de desarrollo para AMQP

source: Dev Services for AMQP is automatically enabled unless:
es_es: Los servicios de desarrollo para AMQP se activan automáticamente a menos que:

source: Dev Services for AMQP starts the container with the `quarkus-dev-service-amqp` label which is used to identify the container.
es_es: Dev Services for AMQP inicia el contenedor con la etiqueta `quarkus-dev-service-amqp` que se utiliza para identificar el contenedor.

source: Dev Services for Apicurio Registry
es_es: Servicios de desarrollo para Apicurio Registry

source: Dev Services for Apicurio Registry is automatically enabled unless:
es_es: Los Servicios de Desarrollo para el Registro de Apicurio se activan automáticamente a menos que:

source: Dev Services for Apicurio Registry starts the container with the `quarkus-dev-service-apicurio-registry` label which is used to identify the container.
es_es: Dev Services for Apicurio Registry inicia el contenedor con la etiqueta `quarkus-dev-service-apicurio-registry` que se utiliza para identificar el contenedor.

source: Dev Services for Elasticsearch
es_es: Servicios de desarrollo para Elasticsearch

source: Dev Services for Elasticsearch is automatically enabled unless:
es_es: Los servicios de desarrollo para Elasticsearch se activan automáticamente a menos que:

source: Dev Services for Elasticsearch starts the container with the `quarkus-dev-service-elasticsearch` label which is used to identify the container.
es_es: Dev Services for Elasticsearch inicia el contenedor con la etiqueta `quarkus-dev-service-elasticsearch` que se utiliza para identificar el contenedor.

source: Dev Services for Kafka
es_es: Servicios de desarrollo para Kafka

source: Dev Services for Kafka is automatically enabled unless:
es_es: Los servicios de desarrollo para Kafka se activan automáticamente a menos que:

source: Dev Services for Kafka starts the container with the `quarkus-dev-service-kafka` label which is used to identify the container.
es_es: Dev Services for Kafka inicia el contenedor con la etiqueta `quarkus-dev-service-kafka` que se utiliza para identificar el contenedor.

source: Dev Services for Kafka supports https://redpanda.com[Redpanda] and https://strimzi.io[Strimzi] (in https://github.com/apache/kafka/blob/trunk/config/kraft/README.md[Kraft] mode).
es_es: Dev Services for Kafka soporta htps://redpanda.com[Redpanda] y link:https://strimzi.io[Strimzi] (en modo https://github.com/apache/kafka/blob/trunk/config/kraft/README.md[Kraft] ).

source: Dev Services for Kubernetes
es_es: Servicios de desarrollo para Kubernetes

source: Dev Services for Kubernetes is automatically enabled unless:
es_es: Dev Services para Kubernetes se activa automáticamente a menos que:

source: Dev Services for Kubernetes starts the container with the `quarkus-dev-service-kubernetes` label which is used to identify the container.
es_es: Dev Services for Kubernetes inicia el contenedor con la etiqueta `quarkus-dev-service-kubernetes` que se utiliza para identificar el contenedor.

source: Dev Services for RabbitMQ
es_es: Servicios de desarrollo para RabbitMQ

source: Dev Services for RabbitMQ is automatically enabled unless:
es_es: Los servicios de desarrollo para RabbitMQ se activan automáticamente a menos que:

source: Dev Services for RabbitMQ starts the container with the `quarkus-dev-service-rabbitmq` label which is used to identify the container.
es_es: Dev Services for RabbitMQ inicia el contenedor con la etiqueta `quarkus-dev-service-rabbitmq` que se utiliza para identificar el contenedor.

source: Dev Services for Redis
es_es: Servicios de desarrollo para Redis

source: Dev Services for Redis starts the container with the `quarkus-dev-service-redis` label which is used to identify the container.
es_es: Dev Services for Redis inicia el contenedor con la etiqueta `quarkus-dev-service-redis` que se utiliza para identificar el contenedor.

source: Dev UI
es_es: Interfaz de usuario

source: Dev mode and Testing
es_es: Modo de desarrollo y pruebas

source: Dev-mode features
es_es: Características del modo de desarrollo

source: Developer Joy
es_es: Satisfacción del desarrollador

source: Developers are critical to the success of almost every organization and they need the tools to build cloud-native applications quickly and efficiently. Quarkus provides a frictionless development experience through a combination of tools, libraries, extensions, and more. Quarkus makes developers more efficient with tools to improve the inner loop development cycle while in dev mode.
es_es: Los desarrolladores son fundamentales para el éxito de casi todas las organizaciones y necesitan las herramientas para crear aplicaciones nativas de la nube de forma rápida y eficiente. Quarkus proporciona una experiencia de desarrollo sin fricciones a través de una combinación de herramientas, bibliotecas, extensiones y más. Quarkus hace que los desarrolladores sean más eficientes con herramientas para mejorar el ciclo de desarrollo del bucle interno mientras están en modo de desarrollo.

source: Development Mode
es_es: Modo de desarrollo

source: Discover Maven goals
es_es: Descubre los objetivos de Maven
